Repository: FelipeAugustoAraujo/CocoVerdeFlutter
Catalog: lib/l10n/intl_*.arb
Languages: pt

# appTitle
source: Coconut Water Store
pt: Loja de Água de Coco

# welcomeMessage
source: Welcome to our store!
pt: Bem-vindo à nossa loja!

# pageRegisterLoginValidationError
source: The name must be at least {min} characters long.
pt: O nome deve ter pelo menos {min} caracteres.

# pageRegisterLastNameValidationError
source: The last name must be at least {min} characters long.
pt: O sobrenome deve ter pelo menos {min} caracteres.

# pageRegisterMailValidationError
source: Please enter a valid email address.
pt: Por favor, insira um endereço de e-mail válido.

# pageRegisterPasswordValidationError
source: Password must be at least {min} characters long and include letters and numbers.
pt: A senha deve ter pelo menos {min} caracteres e incluir letras e números.

# pageRegisterConfirmationPasswordValidationError
source: Confirmation password must match the password and be at least {min} characters long.
pt: A senha de confirmação deve corresponder à senha e ter pelo menos {min} caracteres.

# pageRegisterTermsAndConditionsValidationError
source: You must accept the terms and conditions.
pt: Você deve aceitar os termos e condições.

# pageSettingsFirstnameErrorValidation
source: The first name must be at least {min} characters long.
pt: O primeiro nome deve ter pelo menos {min} caracteres.

# pageSettingsLastnameErrorValidation
source: The last name must be at least {min} characters long.
pt: O sobrenome deve ter pelo menos {min} caracteres.

# pageSettingsEmailErrorValidation
source: Please enter a valid email address.
pt: Por favor, insira um endereço de e-mail válido.
